W11D4/Todos/app/controllers/api/todos_controller.rb

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @todo = Todo.find(params[:id])

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "todos" WHERE "todos"."id" = $1  [["id", 4]]
---
    def destroy
        @todo = Todo.find(params[:id])
        @todo.destroy