W7D2/music_app/app/controllers/bands_controller.rb

    def destroy
        @band = Band.find(params[:id])
        if @band.destroy
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 1]]